CATEGORIES = [
    ('Кран', 'кран кухонный'),
    ('дрель', 'дрель электрическая проф.'),
    ('паркетная доска', 'натральная паркетная доска'),
    ('бочка', 'бочка'),
    ('керамическая плитка', 'напольная керамическая плитка'),
]

UNITS = [
    ('шт',),
    ('метр',),
    ('кв.метр',),
    ('кг',),
    ('литр',),
]

POSITION = [
    ('директор',),
    ('бухгалтер',),
    ('начальник отдела продаж',),
    ('кладовщик',),
    ('грузчик',),
    ('кассир',),
]

GOODS = [
    ('кран GHROE', 1, 1),
    ('дрель BOSHE', 1, 2),
    ('паркет Дуб', 3, 3),
    ('бочка пластиковая 200л', 1, 4),
    ('плитка KeramaMarazzi', 3, 5),
]

EMPLOYEE = [
    ('Иванов Иван Иванови', 1),
    ('Сергеев Сергей Сергеевич', 2),
    ('Степанов Александр Степанович', 3),
    ('Романов Роман Евгеньевич', 4),
    ('Черкесов Оран Гутанович', 5),
    ('Николаева Аглая Евгеньевна', 6),
]

VENDORS = [
    ('Карат', 'АО', 'Россия,Москва,ул.9мая, дом 13', '+79693632514', '123@mail.ru'),
    ('Магнит', 'ООО', 'Россия,Смоленск,ул.9мая, дом 13', '+79693632514', '123@mail.ru'),
    ('Весёлый Роджер', 'ЗАО', 'Россия,Ижевск,ул.9мая, дом 13', '+79693632514', '123@mail.ru'),
    ('Гроздь', 'ИП', 'Россия,Воронеж,ул.9мая, дом 13', '+79693632514', '123@mail.ru'),
    ('Кипарис', 'ИМ', 'Россия,Саратов,ул.9мая, дом 13', '+79693632514', '123@mail.ru'),
    ('Мастерок', 'ЗАО', 'Россия,Пенза,ул.9мая, дом 13', '+79693632514', '123@mail.ru'),
]
